Repository: projekt-inzynierski/survey_frontend
Catalog: lib/l10n/app_*.arb
Languages: pl

source: Username
pl: Nazwa użytkownika

source: Password
pl: Hasło

source: Login
pl: Zaloguj się

# weNeedInformation
source: We need some information about you
pl: Potrzebujemy kilku informacji o Tobie

source: Let's start
pl: Zaczynamy

source: Life satisfaction
pl: Zadowolenie z życia

source: Stress level
pl: Poziom stresu

source: Quality of sleep
pl: Jakość snu

source: Next
pl: Dalej

source: Health condition
pl: Stan zdrowia

source: Medication use
pl: Zażywane leki

source: Gender
pl: Płeć

source: Age category
pl: Kategoria wiekowa

source: Employment
pl: Zatrudnienie

source: Education
pl: Wykształcenie

source: Greenery area
pl: Tereny zielone

# initializeSurveyQuestion
source: Do you want to start the survey?
pl: Czy chcesz rozpocząć wypełnianie ankiety?

source: Start
pl: Rozpoczęcie

# endSurveyQuestion
source: Do you want to end the survey? You will not be able to edit your answers later.
pl: Czy na pewno chcesz zakończyć ankietę? Nie będziesz mógł potem edytować odpowiedzi.

source: Finish
pl: Zakończ

source: Error
pl: Błąd

# nextSurveyTime
source: Remaining time until the most urgent survey finishes
pl: Pozostały czas do zakończenia najbliższej ankiety

source: Survey details
pl: Szczegóły ankiety

# loadingSurveyErrorTryAgainLater
source: Failed to load the survey. Please try again later.
pl: Nie udało się załadować ankiet. Spróbuj ponownie później.

# loadingSurveyError
source: Failed to load selected survey
pl: Nie udało się załadować wybranej ankiety

# answerSubmitError
source: Failed to submit the answer
pl: Nie udało się przesłać odpowiedzi

# mainPageTransitionError
source: The response was successfully sent to the server, but an error occurred while returning to the home page. Try restarting the application.
pl: Pomyślnie przesłano odpowiedź na serwer, ale wystąpił błąd podczas powrotu na stronę główną. Spróbuj ponownie uruchomić aplikację.

# selectOneOption
source: Select one of the options
pl: Wybierz jedną z opcji

# noInternetTryAgain
source: You don't have an internet connection. Try again later
pl: Nie masz połączenia z internetem. Spróbuj ponownie później.

source: Woman
pl: Kobieta

source: Man
pl: Mężczyzna

source: Invalid credentials
pl: Nieprawidłowe dane logowania

# passwordNotEmpty
source: Password must not be empty
pl: Hasło nie może być puste

# passwordTooLong
source: Password must not be longer than {max} characters
pl: Hasło nie może być dłuższe niż {max} znaków

# usernameNotEmpty
source: Username must not be empty
pl: Nazwa użytkownika nie może być pusta

# usernameTooLong
source: Username must not be longer than {max} characters
pl: Nazwa użytkownika nie może być dłuższa niż {max} znaków

source: hours
pl: Godzin

source: minutes
pl: Minut

# valueNotEmpty
source: Value must not be empty
pl: Wartość nie może być pusta

source: Error, retry
pl: Błąd, spróbuj ponownie

source: Yes
pl: Tak

source: No
pl: Nie

# usedSensor
source: Temperature sensor kind
pl: Rodzaj czujnika temperatury

source: Save
pl: Zapisz

# chooseATemperatureSensorYouReceived
source: Choose a temperature sensor you've received
pl: Wybierz otrzymany przez Ciebie czujnik temperatury

source: No sensor
pl: Brak czujnika

source: Xiaomi sensor
pl: Czujnik Xiaomi

source: Settings
pl: Ustawienia

source: Edit sensor
pl: Edytuj czujnik

source: App settings
pl: Ustawienia aplikacji

# surveyStartBody
source: You can start the survey now. Are you ready?
pl: Możesz już rozpocząć ankiete. Jesteś gotów?

# surveyFinishBody
source: Survey is about to end. Let's do it!
pl: Ankieta zaraz się skończy. Do dzieła!

# pleaseEnterNumber
source: Please enter a number
pl: Proszę wpisać liczbę

# enterNumber
source: Enter a number
pl: Wpisz liczbę

# pleaseEnterValidNumber
source: Please enter a valid number
pl: Proszę wpisać poprawną liczbę

# pleaseEnterLeastZeroNumber
source: Please enter a number that is at least 0
pl: Proszę wpisać liczbę liczbę większą lub równą 0

# pleaseEnterNumberLessThan1000
source: Please enter a number less than 1000
pl: Proszę wpisać liczbę mniejszą od 1000

# pleaseEnterAnyText
source: Please write your answer
pl: Proszę uzupełnić odpowiedź

# pleaseEnterShorterText
source: Please write your answer in less than 1000 characters
pl: Odpowiedź ma więcej niż 1000 znaków

# selectAtLeastOneOption
source: Please select at least one option
pl: Proszę wybrać przynajmniej jedną opcję

source: API url
pl: Adres API

# apiUrlEmptyErrorMessage
source: API url cannot be empty
pl: Adres API nie może być pusty

# apiUrlInvalidFormatErrorMessage
source: Invalid format
pl: Niepoprawny format

source: Logout
pl: Wyloguj się

# logountConfirmationQuestion
source: Are you sure you want to log out? All data that has not been uploaded to the server will be lost.
pl: Czy na pewno chcesz się wylogować? Wszystkie dane, które nie zostały przesłane na serwer, zostaną utracone

# couldNotLogout
source: Could not log out, try again later.
pl: Nie udało się wylogować, spróbuj ponownie później.

# credentialsExpired
source: Your token has expired, reenter password.
pl: Twój token wygasł, ponownie wprowadź hasło.

source: Profile
pl: Profil

# couldNotReachTheServer
source: Failed to send the request, please try again later.
pl: Nie udało się wysłać żądania, spróbuj ponownie później.

# somethingWentWrong
source: Something went wrong, please try again later.
pl: Coś poszło nie tak, spróbuj ponownie później.

source: Location permission denied
pl: Odmowa dostępu do lokalizacji

# locationPermissionDeniedMessage
source: Location permission is required to fill the surveys. Please click "Open settings" and enable location permission.
pl: Dostęp do lokalizacji jest wymagany aby wypełnić ankietę. Proszę nacisnąć "Otwórz ustawienia" i włączyć uprawnienia lokalizacji.

# locationBackgroundPermissionDenied
source: Background location permission missing
pl: Brak uprawnień do lokalizacji w tle

# locationBackgroundPermissionDeniedMessage
source: Background location permission is recommended to be enabled. Please click "Open settings" and then chose "Allow all the time".
pl: Zalecane jest włączenie uprawnienia na dostęp do lokalizacji w tle. Proszę kliknąć "Otwórz ustawienia" a następnie wybrać "Zawsze zezwalaj".

source: Open settings
pl: Otwórz ustawienia

source: Close
pl: Zamknij

source: Notifications
pl: Powiadomienia

source: Privacy
pl: Prywatność

source: Privacy settings
pl: Ustawienia prywatności

# allowTrackLocation
source: Allow location tracking
pl: Zezwalaj na śledzenie lokalizacji

source: Time from
pl: Godzina od

source: Time to
pl: Godzina do

source: Notify me about surveys
pl: Powiadom mnie o ankietach

source: Open privacy policy
pl: Otwórz politykę prywatności

source: Change password
pl: Zmiana hasła

source: Current password
pl: Aktualne hasło

source: New password
pl: Nowe hasło

source: Retype password
pl: Powtórz hasło

# passwordChangedSuccessfully
source: Your password has been successfully changed!
pl: Twoje hasło zostało pomyślnie zmienione!

source: Current password must not be empty
pl: Aktualne hasło nie może być puste

# minNewPasswordLenError
source: The minimum length is 8 characters
pl: Minimalna długość wynosi 8 znaków

# retypePasswordMustBeEqualToNewPassword
source: New password does not match
pl: Źle przepisane nowe hasło

source: I accept privacy policy
pl: Akceptuję politykę prywatności

source: Scroll to the very bottom
pl: Przewiń na sam dół

# loadingImageFailed
source: Could not load the image
pl: Nie udało się załadować zdjęcia

# multiplePermissionsDenied
source: Permissions missing
pl: Brakuje uprawnień

# multiplePermissionsDeniedMessage
source: Please enable denied permissions in your device settings by going to Permissions in settings.
pl: Włącz brakujące uprawnienia w ustawieniach urządzenia. Przejdź do Uprawnienia i włącz odrzucone.

# surveyFinishTitle
source: Finishing Survey
pl: Koniec Ankiety

# surveyStartTitle
source: New Survey
pl: Nowa Ankieta

# sensorDataHistory
source: Historical readings
pl: Historyczne odczyty

source: Save reading
pl: Zapisz odczyt

source: Scanning
pl: Skanowanie

# bluetoothTurnedOff
source: Bluetooth is turned off
pl: Bluetooth jest wyłączony

# sensorNotFound
source: Could not detect sensor
pl: Nie znaleziono czujnika

source: Sensor not specified
pl: Nie wybrano czujnika

source: Sensor data
pl: Dane z czujnika

source: Calendar
pl: Kalendarz

source: Day
pl: Dzień

source: Week
pl: Tydzień

source: Survey name
pl: Nazwa ankiety

# end
source: Finish
pl: Zakończenie

source: Sensor history
pl: Historia czujnika

source: Date from
pl: Data od

source: Date to
pl: Data do

source: Clear filters
pl: Wyczyść filtry

source: Apply
pl: Zastosuj

source: This week
pl: Ten tydzień

source: From
pl: Od

source: To
pl: Do

source: Date
pl: Data

source: Temperature
pl: Temperatura

source: Humidity
pl: Wilgotność

# sentToServer
source: Sent to the server
pl: Przesłano na serwer

source: Map
pl: Mapa

source: Today
pl: Dzisiaj

# latidude
source: Latitude
pl: Szerokość geograficzna

source: Longitude
pl: Długość geograficzna

source: Time
pl: Czas

# theLocationDataHasBeenSubmitedToServer
source: This location has already been submitted to the server
pl: Ta lokalizacja została wysłana na serwer

# theLocationDataHasNotBeenSubmitedToServer
source: This location has not been submitted to the server yet
pl: Ta lokalizacja nie została jeszcze wysłana na serwer

# surveyHasBeenComplitedInThisLocation
source: There was a survey filled in this location
pl: W tym miejscu wypełniono ankietę

source: Enter response
pl: Podaj odpowiedź

# kestrelDrop2
source: Kestrel Drop 2 sensor
pl: Czujnik Kestrel Drop 2

source: Sensor id
pl: Id sensora

# serverNotResponding
source: Server is not responding. Make sure, you have provided a correct API url. If so, try again later.
pl: Serwer nie odpowiada. Upewnij się, że podałeś poprawny adres API. Jeśli tak, spróbuj ponownie później.

# bluetoothRequired
source: Turn on bluetooth, to complete the survey.
pl: Włącz bluetooth, aby wypełnić ankietę.

# surveyFinished
source: The survey has finished. You can't complete it anymore.
pl: Ankieta zakończyła się. Nie można jej już wypełnić.

# sensorMac
source: Sensor's MAC adres
pl: Adres MAC czujnika

# sensorIdServerNotFound
source: Sensor id not found on the server
pl: Id czujnika nie zostało znalezione na serwerze

source: No internet connection
pl: Brak połączenia z internetem

# betterExperienceTurnOnInternet
source: For better experience, turn on the internet connection
pl: Dla lepszego doświadczenia z użytkowania, proszę włączyć połączenie z internetem

# loadingMacFailed
source: Could not load MAC address
pl: Błąd ładowania adresu MAC

# sensorNotFoundDialogTitle
source: Sensor not found
pl: Nie znaleziono czujnika

# sensorNotFoundDialogContent
source: Temperature sensor not found. The survey will be sent without temperature data. Please make sure you have the sensor with you and that it has a charged battery.
pl: Nie znaleziono czujnika temparatury. Anketa zostanie wysłana bez danych o temperaturze. Upewnij się, że masz przy sobie czujnik, oraz że ma on nałądowaną baterię.
